In [1]:
import numpy as np
import pandas as pd

## <u>Series Object</u>

### Creating a Series object from list

In [2]:
data = pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
data.values

array([ 0.25,  0.5 ,  0.75,  1.  ])

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data[1:3]

1    0.50
2    0.75
dtype: float64

### Creating a Series object from dictionary

A Series object can be thought of a Python dictionary that maps typed keys to a set of typed values.  By default, index is drawn from the sorted keys.

In [6]:
population_dict = {'California':38332521,
                  'Texas':26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [7]:
population['California':'Illinois']

California    38332521
Florida       19552860
Illinois      12882135
dtype: int64

### Other ways of creating a Series object

In [8]:
pd.Series(5, index=[100,200,300])

100    5
200    5
300    5
dtype: int64

## <u>DataFrame Object</u>

### DataFrame as a generalized NumPy array

If a Series is an analog of a 1-D array with flexible indices, a DataFrame is an analog or a 2-D array with both flexible row indices and flexible column names.  A DataFrame can be thought of as a sequence of aligned Series objects (ie. Series objects that share a common index).

In [9]:
area_dict = {'California':423967,
             'Texas':695662,
             'New York': 141297,
             'Florida': 170312,
             'Illinois': 149995}
area = pd.Series(area_dict)

states = pd.DataFrame({'population': population,
                      'area': area})
states

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

### DataFrame as specialized dictionary

While a dictionary maps a key to a value, a <b>DataFrame</b> maps a column name to a value of type, Series.  Alternatively, DataFrame maps a column name to a Series of column data.

In [10]:
states["area"]

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

### Constructing DataFrame objects

##### From a single Series object

In [11]:
pd.DataFrame(population)

                   0
California  38332521
Florida     19552860
Illinois    12882135
New York    19651127
Texas       26448193

In [12]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193

##### From a list of dicts

In [13]:
data = [{"a":i, "b":2*i} for i in range(4)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4
3  3  6

In [14]:
pd.DataFrame([{'a':1, 'b':2}, {'b':3, 'c':4}])  #missing keys will be filled in with NaN

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

##### From a dictionary of Series objects

In [15]:
pd.DataFrame({'population': population,
              'area': area})

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

##### From a 2-D NumPy array

In [16]:
pd.DataFrame(np.random.rand(3,2))

          0         1
0  0.870919  0.357614
1  0.428008  0.996799
2  0.110448  0.246813

In [17]:
pd.DataFrame(np.random.rand(3,2),
            columns=['foo','bar'],
            index=['a','b','c'])

        foo       bar
a  0.991281  0.189562
b  0.067579  0.393109
c  0.527648  0.339820

##### From a NumPy structured array

In [18]:
A = np.zeros(3, dtype=[('A','i8'),('B','f8')])
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

## <u>Index Object</u>

An <b>Index</b> object can be thought of as either an immutable array or an ordered set (technically, multiset -- may contain repeated values).

In [19]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

### Index as an immutable array

In [20]:
ind[1]

3

In [21]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [22]:
ind[1]=0

TypeError: Index does not support mutable operations

### Index as an ordered set

In [23]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

## Intersection
indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [24]:
## Union
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [25]:
## Symmetric difference
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

# Data Indexing and Selection

## Data Selection in Series

#### ...as dictionary

In [26]:
data = pd.Series([0.25,0.5,0.75,1.0], index=['a','b','c','d'])

data['b']

0.5

In [27]:
'a' in data

True

In [28]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [29]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [30]:
data['e']=1.25
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0), ('e', 1.25)]

#### ...as 1-D array

Array-style item selection -- slices, masking, and fancy indexing

In [31]:
# ***Note that final index is included (explicit index)!!!***
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [32]:
# ***Note that final index is excluded (implicit index)!!!***
# Slicing generally uses implicit indexing
data[0:3]

a    0.25
b    0.50
c    0.75
dtype: float64

In [33]:
data[(data>0.3) & (data<0.8)]

b    0.50
c    0.75
dtype: float64

In [34]:
## fancy indexing
data[['a','e']]

a    0.25
e    1.25
dtype: float64

## Data Selection in DataFrame

#### ...as a dictionary of related Series objects

In [35]:
data = pd.DataFrame({'area':area, 'pop':population})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [36]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [37]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

#### ...as a 2-D array

In [38]:
data.values

array([[  4.23967000e+05,   3.83325210e+07,   9.04139261e+01],
       [  1.70312000e+05,   1.95528600e+07,   1.14806121e+02],
       [  1.49995000e+05,   1.28821350e+07,   8.58837628e+01],
       [  1.41297000e+05,   1.96511270e+07,   1.39076746e+02],
       [  6.95662000e+05,   2.64481930e+07,   3.80187404e+01]])

In [39]:
data.T

           California       Florida      Illinois      New York         Texas
area     4.239670e+05  1.703120e+05  1.499950e+05  1.412970e+05  6.956620e+05
pop      3.833252e+07  1.955286e+07  1.288214e+07  1.965113e+07  2.644819e+07
density  9.041393e+01  1.148061e+02  8.588376e+01  1.390767e+02  3.801874e+01

#### ...quirks

In [40]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [41]:
data.loc[:'Illinois',:'pop']

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [42]:
data.ix[:3,:'pop']

C:\Users\James\Desktop\eclipse_workspace\conda_eclipse_env\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

# Operating on Data

### Ufuncs: Index Preservation

<u>Unary operations</u> - ufuncs preserve index and column labels in the output

In [43]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [44]:
df = pd.DataFrame(rng.randint(0, 10, (3,4)),
                 columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [45]:
# Indices are preserved:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

### Ufuncs: Index Alignment

<u>Binary operations</u> - ufuncs align indices in the process of performing the operation

##### ...in Series

In [46]:
area = pd.Series({'Alaska': 1723337,
                 'Texas':695662,
                 'California': 423967}, name='area')

population = pd.Series({'California':38332521,
                       'Texas':26448193,
                       'New York':19651127}, name='population')

# Resulting array contains the union of indices of the two input arrays.
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [47]:
# Note similarity to Python set arithmetic
# Union
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [48]:
# All arithmetic expressions (binary operators) are filled in with NaN by default
# This may not be desirable behavior:

A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [49]:
# To correct, use object methods in place of operators + 'fill_value' argument:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

##### ...in DataFrame

Similar type of alignment takes place for both columns and indices when using DataFrames

In [50]:
# Indices are aligned correctly, regardless of their order in the two objects.  Indices in the result are sorted.
A = pd.DataFrame(rng.randint(0,20,(2,2)),columns=list('AB'))
B = pd.DataFrame(rng.randint(0,10,(3,3)),columns=list('BAC'))
A+B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

### Ufuncs: Operations Between DataFrame and Series objects

Similar to operations between 2-D and 1-D NumPy arrays

In [51]:
A = rng.randint(10,size=(3,4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [52]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [53]:
# Apply column-wise operation:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [54]:
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    2
Name: 0, dtype: int32

In [55]:
122/500

0.244

# Handling Missing Data

## Operating on Null Values

#### Detecting null values

In [56]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [57]:
data[data.notnull()]

0        1
2    hello
dtype: object

#### Dropping null values

In [58]:
data.dropna()

0        1
2    hello
dtype: object

For a DataFrame, dropna() provides additional arguments to support more options:

In [59]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2,3,5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [60]:
## By default, dropna() will drop all rows in which any null value is present:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [61]:
## With additional option, dropna() drops columns with null value:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [62]:
## Dropping rows or columns with all or majority NaN values:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [63]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [64]:
## Specify minimum number of *non-null* values for row/column to be kept
df.dropna(axis='rows',thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

#### Filling null values

When you'd rather replace NaN / None values with a valid value.

In [65]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [66]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [67]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [68]:
## forward-fill propagates previous value
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [69]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [70]:
## For df, options are similar but 'axis' can be specified
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [71]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

# Hierarchical Indexing

## A Multiply Indexed Series

#### Pandas MultiIndex

In [72]:
index = [('California',2000), ('California',2010),
        ('New York', 2000), ('New York', 2010),
        ('Texas', 2000),('Texas', 2010)]

index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [73]:
populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [74]:
# Access all data for which the second index is 2010

pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

#### MultiIndex as extra dimension

In [75]:
# convert multiply-indexed Series object into a conventionally-indexed DataFrame

pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [76]:
# Opposite direction
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## Methods of MultiIndex Creation

In [77]:
# Most straightforward way: pass list of 2+ index arrays to the constructor

df = pd.DataFrame(np.random.rand(4,2),
                 index=[['a','a','b','b'], [1,2,1,2]],
                 columns=['data1', 'data2'])
df

# Dictionary can also be used - see documentation (or p. 132)

        data1     data2
a 1  0.352090  0.785492
  2  0.389326  0.721430
b 1  0.046840  0.115210
  2  0.692869  0.248582

#### Explicit MultiIndex constructors

Pass any of these objects as the index arg when creating a Series of df

In [78]:
# Construct MultiIndex from simple list of arrays:

pd.MultiIndex.from_arrays([['a','a','b','b'], [1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [79]:
# Construct MultiIndex from list of tuples:

pd.MultiIndex.from_tuples([('a',1), ('a',2), ('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [80]:
# Construct MultiIndex from Cartesian product of single indices:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [81]:
# Similarly, construct MultiIndex with levels and labels args
pd.MultiIndex(levels=[['a','b'],[1,2]],
             labels = [[0,0,1,1],[0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

#### MultiIndex level names 
Name levels of the MultiIndex

In [82]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### MultiIndex for columns

In [83]:
index = pd.MultiIndex.from_product([[2013, 2014], [1,2]],
                                  names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']], names=['subject','type'])

data = np.round(np.random.randn(4,6), 1)
data[:, ::2] *= 10
data += 37

health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  37.3  44.0  37.1  52.0  36.2
     2      41.0  35.7  44.0  37.3  48.0  37.2
2014 1      21.0  36.3  19.0  36.0  39.0  36.3
     2      28.0  38.2  40.0  35.8  48.0  37.3

In [84]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      44.0  37.1
     2      44.0  37.3
2014 1      19.0  36.0
     2      40.0  35.8

## Indexing and Slicing a MultiIndex

#### Multiply indexed Series

In [85]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [86]:
# Access single elements
pop['California', 2000]

33871648

In [87]:
# Partial indexing (ie. indexing only one of the levels in the index) -> returns Series
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [88]:
# Partial slicing
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [89]:
# Partial indexing on lower levels
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [90]:
#Selection based on Boolean masks
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [91]:
#Selection based on fancy indexing
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

#### Multiply indexed DataFrames

In [92]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  37.3  44.0  37.1  52.0  36.2
     2      41.0  35.7  44.0  37.3  48.0  37.2
2014 1      21.0  36.3  19.0  36.0  39.0  36.3
     2      28.0  38.2  40.0  35.8  48.0  37.3

In [93]:
# **COLUMNS ARE PRIMARY IN A DataFrame (syntax from multi-indexed Series applies to columns)
health_data['Guido','HR']

year  visit
2013  1        44.0
      2        44.0
2014  1        19.0
      2        40.0
Name: (Guido, HR), dtype: float64

In [94]:
# indexers are helpful
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      35.0  37.3
     2      41.0  35.7

In [95]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        35.0
      2        41.0
2014  1        21.0
      2        28.0
Name: (Bob, HR), dtype: float64

In [96]:
# IndexSlice object used for working with slices within these index tuples
idx = pd.IndexSlice
health_data.loc[idx[:,1], idx[:, 'HR']]  # selecting a subset of each DataFrame dimension (ie. index levels)

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      35.0  44.0  52.0
2014 1      21.0  19.0  39.0

## Rearranging Multi-Indices

#### Sorted and unsorted indices
<i>Many of the MultiIndex slicing operations will fail if the index is not sorted.</i>

In [97]:
index = pd.MultiIndex.from_product([['a','c','b'], [1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.050576
      2      0.555261
c     1      0.765098
      2      0.680895
b     1      0.502734
      2      0.994575
dtype: float64

In [100]:
data = data.sort_index()
data

char  int
a     1      0.050576
      2      0.555261
b     1      0.502734
      2      0.994575
c     1      0.765098
      2      0.680895
dtype: float64

In [101]:
data['a':'b']

char  int
a     1      0.050576
      2      0.555261
b     1      0.502734
      2      0.994575
dtype: float64

#### Stacking and unstacking indices
Convension between multi-index to simple 2-D representation.

In [102]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [103]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [104]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

#### Index setting and resetting

In [110]:
pop_flat = pop.reset_index(name='population')  # without kwarg, last column name is 0
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [111]:
# Build MultiIndex from column values with df.set_index()
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data Aggregations on Multi-Indices

In [112]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  37.3  44.0  37.1  52.0  36.2
     2      41.0  35.7  44.0  37.3  48.0  37.2
2014 1      21.0  36.3  19.0  36.0  39.0  36.3
     2      28.0  38.2  40.0  35.8  48.0  37.3

In [116]:
data_mean = health_data.mean(level='year')  # control which subset of data aggregate computed on.
data_mean

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR  Temp
year
2013     38.0  36.50  44.0  37.2  50.0  36.7
2014     24.5  37.25  29.5  35.9  43.5  36.8

In [120]:
data_mean.mean(axis=1, level='type')

type    HR   Temp
year
2013  44.0  36.80
2014  32.5  36.65

# Combining Datasets

In [121]:
# Convenience function to create a DataFrame of a particular form

def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
           for c in cols}
    return pd.DataFrame(data, ind)

make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [122]:
# Simple concatenation of Series objects
ser1 = pd.Series(['A','B','C'], index=[1,2,3])
ser2 = pd.Series(['D','E','F'], index=[4,5,6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [124]:
# Simple concatenation of DataFrame objects
df1 = make_df('AB', [1,2])
df2 = make_df('AB', [3,4])
print(df1); print(df2); print(pd.concat([df1, df2]))

#by default, concatenation takes place row-wise

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [126]:
df3 = make_df('AB', [0,1])
df4 = make_df('CD', [0,1])
print(df3); print(df4); print(pd.concat([df3, df4], axis='columns'))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

#### Duplicate indices
look up verify_integrity, ignore_index, and keys kwargs

#### Concatenation with joins

In [127]:
df5 = make_df('ABC', [1,2])
df6 = make_df('BCD', [3,4])
print(df5); print(df6); print(pd.concat([df5, df6])) # default is an outer join (ie. union) of the columns

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [128]:
pd.concat([df5,df6], join='inner') # INner join = INtersection of columns!!!

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [129]:
pd.concat([df5,df6], join_axes=[df5.columns])

     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

#### append() method

In [130]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

# Combining Datasets - Merge and Join

## Categories of Joins

#### One-to-one joins

In [131]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [132]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### Many-to-one joins
One of the two key columns contains duplicate entries.

In [133]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                   'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

#### Many-to-many joins
Key column in both the left and right array contains duplicates.

In [134]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
                   'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization